# 前言

- pd.Series.Count.idxmax()
- pd.Series.Count.median()
- pd.Series.Count一般和groupby连用。本教程中index是名字。特征是名字出现次数count。idxmax可以返回count出现最多的name

# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [3]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [4]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names = pd.read_csv(url)
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names = baby_names.iloc[:,2:]
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

### Step 7. Group the dataset by name and assign to names

In [12]:
names = baby_names.groupby('Name').sum()
names.sort_values(by='Count', ascending=False)

               Year   Count
Name
Jacob       1141099  242874
Emma        1137085  214852
Michael     1161152  214405
Ethan       1139091  209277
Isabella    1137090  204798
...             ...     ...
Eniola         2012       5
Atlantis       2005       5
Marci          2004       5
Simarpreet     2011       5
Nita           2007       5

[17632 rows x 2 columns]

### Step 8. How many different names exist in the dataset?

In [14]:
names.shape[0]

17632

### Step 9. What is the name with most occurrences?

In [31]:
del names['Year']

In [32]:
names.head()

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

In [15]:
type(names)

pandas.core.frame.DataFrame

In [33]:
names.Count.idxmax()

'Jacob'

In [29]:
help(names.Count.idxmax)

Help on method idxmax in module pandas.core.series:

idxmax(axis=0, skipna=True, *args, **kwargs) method of pandas.core.series.Series instance
    Return the row label of the maximum value.

    If multiple values equal the maximum, the first row label with that
    value is returned.

    Parameters
    ----------
    axis : int, default 0
        For compatibility with DataFrame.idxmax. Redundant for application
        on Series.
    skipna : bool, default True
        Exclude NA/null values. If the entire Series is NA, the result
        will be NA.
    *args, **kwargs
        Additional arguments and keywords have no effect but might be
        accepted for compatibility with NumPy.

    Returns
    -------
    Index
        Label of the maximum value.

    Raises
    ------
    ValueError
        If the Series is empty.

    See Also
    --------
    numpy.argmax : Return indices of the maximum values
        along the given axis.
    DataFrame.idxmax : Return index of first occurrence of maximum
        over requested axis.
    Series.idxmin : Return index *label* of the first occurrence
        of minimum of values.

    Notes
    -----
    This method is the Series version of ``ndarray.argmax``. This method
    returns the label of the maximum, while ``ndarray.argmax`` returns
    the position. To get the position, use ``series.values.argmax()``.

    Examples
    --------
    >>> s = pd.Series(data=[1, None, 4, 3, 4],
    ...               index=['A', 'B', 'C', 'D', 'E'])
    >>> s
    A    1.0
    B    NaN
    C    4.0
    D    3.0
    E    4.0
    dtype: float64

    >>> s.idxmax()
    'C'

    If `skipna` is False and there is an NA value in the data,
    the function returns ``nan``.

    >>> s.idxmax(skipna=False)
    nan

In [26]:
baby_names.Name.value_counts()['Jacob']

568

### Step 10. How many different names have the least occurrences?

In [ ]:
nunique

### Step 11. What is the median name occurrence?

In [39]:
names[names.Count == names.Count.median()] # 里面返回的是布尔值

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [40]:
names.Count.std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [41]:
names.describe(include='all')

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000